- [Dataset](https://www.kaggle.com/c/titanic)

- Please include documentation at [Overleaf](https://www.overleaf.com/project/5ffbf8c398e5780f308630ef) as you make progress

### Importing the libraries

In [2]:
import numpy as np
import pandas as pd

from sklearn.impute import SimpleImputer # used for handling missing data
from sklearn.preprocessing import LabelEncoder, OneHotEncoder # used for encoding categorical data
from sklearn.model_selection import train_test_split # used for splitting training and testing data
from sklearn.preprocessing import StandardScaler # used for feature scaling

## Part 1 - Data Preprocessing

### Importing the dataset

In [3]:
df = pd.read_csv('train.csv')
#output = dataset.iloc[:, 1].values
#features1 = dataset.iloc[:, 2].values
#features2 = dataset.iloc[:,4:-1].values

test = pd.read_csv('test.csv')

In [7]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [86]:
df['Age'][17]
print(imputed['Age'][15])
print(sorted(imputed['Age']))

55.0
[6.0, 11.0, 13.0, 14.0, 18.0, 19.0, 19.0, 21.0, 21.0, 22.0, 22.0, 26.0, 27.0, 27.0, 28.0, 29.0, 29.0, 30.0, 30.0, 31.0, 31.0, 32.0, 32.0, 33.0, 33.0, 36.0, 38.0, 38.0, 39.0, 45.0, nan, 40.0, nan, 40.0, 56.0, nan, nan, nan, nan, nan, nan, nan, 42.0, nan, nan, 2.0, 7.0, 9.0, 10.0, 13.0, 15.0, 16.0, 18.0, 20.0, 21.0, 21.0, 22.0, 22.0, 24.0, 25.0, 25.0, 27.0, 28.0, 29.0, 29.0, 29.0, 30.0, 30.0, 30.0, 31.0, 31.0, 33.0, 34.0, 58.0, nan, 41.0, 44.0, 45.0, 45.0, 47.0, 47.0, 49.0, 50.0, 52.0, 59.0, 60.0, 70.0, nan, nan, nan, 2.0, 4.0, 9.0, 16.0, 16.0, 17.0, 19.0, 19.0, 20.0, 23.0, 24.0, 24.0, 25.0, 26.0, 26.0, 27.0, 27.0, 28.0, 30.0, 31.0, 34.0, nan, 31.0, 39.0, 40.0, nan, nan, 19.0, 23.0, 27.0, 32.0, 32.0, 32.0, 33.0, 35.0, 43.0, 48.0, nan, 49.0, 51.0, 80.0, nan, 55.0, nan, nan, 0.67, 12.0, 15.0, 16.0, 16.0, 18.0, 21.0, 22.0, 23.0, 24.0, 24.0, 26.0, 27.0, 28.0, 30.0, 40.0, nan, 32.0, nan, 4.0, 22.0, 22.0, 28.0, 32.5, 32.5, 33.0, 33.0, 35.0, 36.0, 39.0, 49.0, nan, nan, 39.0, 40.0, 64.0, 65.0, nan, nan, nan, nan, 54.0, nan]

In [10]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [103]:
import pandas as pd
#!pip install datawig
import datawig

data = pd.read_csv("train.csv")

to_exclude = [i+1 for i in range(len(data['Age'])) if math.isnan(data['Age'][i])]
to_keep = [i+1 for i in range(len(data['Age'])) if not math.isnan(data['Age'][i])]

df_train = pd.read_csv("train.csv", skiprows = to_exclude)
df_test = pd.read_csv("train.csv", skiprows = to_keep)

print(df_train.info())
print(df_test.info())


#Initialize a SimpleImputer model
imputer = datawig.SimpleImputer(
    input_columns=['Pclass','SibSp','Parch'], # column(s) containing information about the column we want to impute
    output_column= 'Age', # the column we'd like to impute values for
    output_path = 'imputer_model' # stores model data and metrics
    )

#Fit an imputer model on the train data
imputer.fit(train_df=df_train, num_epochs=50)

#Impute missing values and return original dataframe with predictions
imputed = imputer.predict(df_test)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  714 non-null    int64
 1   Survived     714 non-null    int64
 2   Pclass       714 non-null    int64
 3   Name         714 non-null    object
 4   Sex          714 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        714 non-null    int64
 7   Parch        714 non-null    int64
 8   Ticket       714 non-null    object
 9   Fare         714 non-null    float64
 10  Cabin        185 non-null    object
 11  Embarked     712 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 67.1+ KB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 177 entries, 0 to 176
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  177 non-null    int64
 1   Survived     177 non-null    int64
 2   Pclass       177 non-null    int64
 3   Name         177 non-null    object
 4   Sex          177 non-null    object
 5   Age          0 non-null      float64
 6   SibSp        177 non-null    int64
 7   Parch        177 non-null    int64
 8   Ticket       177 non-null    object
 9   Fare         177 non-null    float64
 10  Cabin        19 non-null     object
 11  Embarked     177 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 16.7+ KB
None

In [115]:
imputed.isnull().sum()
imputed.head()

#print(imputed['Age_imputed'])
print(imputed['Age_imputed'])
print(imputed)

0      26.227928
1      34.319937
2      26.227928
3      26.227928
4      26.227928
         ...
172    26.227928
173     7.387321
174    26.227928
175    26.227928
176    22.604055
Name: Age_imputed, Length: 177, dtype: float64
     PassengerId  Survived  Pclass                                      Name  \
0              6         0       3                          Moran, Mr. James
1             18         1       2              Williams, Mr. Charles Eugene
2             20         1       3                   Masselmani, Mrs. Fatima
3             27         0       3                   Emir, Mr. Farred Chehab
4             29         1       3             O'Dwyer, Miss. Ellen "Nellie"
..           ...       ...     ...                                       ...
172          860         0       3                          Razi, Mr. Raihed
173          864         0       3         Sage, Miss. Dorothy Edith "Dolly"
174          869         0       3               van Melkebeke, Mr. Philemon
175          879         0       3                        Laleff, Mr. Kristo
176          889         0       3  Johnston, Miss. Catherine Helen "Carrie"

        Sex  Age  SibSp  Parch      Ticket     Fare Cabin Embarked  \
0      male  NaN      0      0      330877   8.4583   NaN        Q
1      male  NaN      0      0      244373  13.0000   NaN        S
2    female  NaN      0      0        2649   7.2250   NaN        C
3      male  NaN      0      0        2631   7.2250   NaN        C
4    female  NaN      0      0      330959   7.8792   NaN        Q
..      ...  ...    ...    ...         ...      ...   ...      ...
172    male  NaN      0      0        2629   7.2292   NaN        C
173  female  NaN      8      2    CA. 2343  69.5500   NaN        S
174    male  NaN      0      0      345777   9.5000   NaN        S
175    male  NaN      0      0      349217   7.8958   NaN        S
176  female  NaN      1      2  W./C. 6607  23.4500   NaN        S

     Age_imputed
0      26.227928
1      34.319937
2      26.227928
3      26.227928
4      26.227928
..           ...
172    26.227928
173     7.387321
174    26.227928
175    26.227928
176    22.604055

[177 rows x 13 columns]

In [116]:
import math
cnt=0

for i in range(len(df['Age'])):
    
    if math.isnan(df['Age'][i]):
        df['Age'][i] = imputed['Age_imputed'][cnt]
        cnt+=1

/Users/xiaoyangpan/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [85]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [118]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None